In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.DataFrame({'From_To':['LoNDon_paris','MAdrid_miLAN','londON_StockhOlm','Budapest_PaRis','Brussels_londOn'],'FlightNumber':[10045,np.nan,10065,np.nan,10085],'RecentDelays':[[23,47],[],[24,43,87],[13],[67,32]],'Airline':['KLM(!)','<Air France>(12)','(British Airways. )','12.Air France','''Swiss Air''']})

In [3]:
df.head()

               Airline  FlightNumber           From_To  RecentDelays
0               KLM(!)       10045.0      LoNDon_paris      [23, 47]
1     <Air France>(12)           NaN      MAdrid_miLAN            []
2  (British Airways. )       10065.0  londON_StockhOlm  [24, 43, 87]
3        12.Air France           NaN    Budapest_PaRis          [13]
4            Swiss Air       10085.0   Brussels_londOn      [67, 32]

In [4]:
df.loc[1]=df.loc[1].fillna(10055)

In [5]:
df.loc[3]=df.loc[3].fillna(10075)

In [6]:
df.head()

               Airline  FlightNumber           From_To  RecentDelays
0               KLM(!)       10045.0      LoNDon_paris      [23, 47]
1     <Air France>(12)       10055.0      MAdrid_miLAN            []
2  (British Airways. )       10065.0  londON_StockhOlm  [24, 43, 87]
3        12.Air France       10075.0    Budapest_PaRis          [13]
4            Swiss Air       10085.0   Brussels_londOn      [67, 32]

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
Airline         5 non-null object
FlightNumber    5 non-null float64
From_To         5 non-null object
RecentDelays    5 non-null object
dtypes: float64(1), object(3)
memory usage: 240.0+ bytes

In [8]:
#converting float to int
df['FlightNumber']=df['FlightNumber'].apply(lambda x: int(x) if x == x else "")

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
Airline         5 non-null object
FlightNumber    5 non-null int64
From_To         5 non-null object
RecentDelays    5 non-null object
dtypes: int64(1), object(3)
memory usage: 240.0+ bytes

In [10]:
#Splitting the column
df['To'] = df["From_To"].str.split('_').str[0]

In [11]:
print(df)

               Airline  FlightNumber           From_To  RecentDelays        To
0               KLM(!)         10045      LoNDon_paris      [23, 47]    LoNDon
1     <Air France>(12)         10055      MAdrid_miLAN            []    MAdrid
2  (British Airways. )         10065  londON_StockhOlm  [24, 43, 87]    londON
3        12.Air France         10075    Budapest_PaRis          [13]  Budapest
4            Swiss Air         10085   Brussels_londOn      [67, 32]  Brussels

In [12]:
#new temporary column
df_temp=pd.DataFrame({'From': ['London','Madrid','London','Budapest','Brussels'],'To' : ['Paris','Milan','Stockholm','Paris','London']})

In [13]:
df_temp.head()

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

In [14]:
#replace column with new temporary column
df['From_To']=df_temp['From']

df['To']=df_temp['To']

In [15]:
df.head()

               Airline  FlightNumber   From_To  RecentDelays         To
0               KLM(!)         10045    London      [23, 47]      Paris
1     <Air France>(12)         10055    Madrid            []      Milan
2  (British Airways. )         10065    London  [24, 43, 87]  Stockholm
3        12.Air France         10075  Budapest          [13]      Paris
4            Swiss Air         10085  Brussels      [67, 32]     London

In [16]:
df=df.rename(columns={'From_To':'From'})

In [17]:
#rearranging them
new_index= ['Airline','FlightNumber','From','To','RecentDelays']
df=df.reindex(columns=new_index)

In [18]:
df.head()

               Airline  FlightNumber      From         To  RecentDelays
0               KLM(!)         10045    London      Paris      [23, 47]
1     <Air France>(12)         10055    Madrid      Milan            []
2  (British Airways. )         10065    London  Stockholm  [24, 43, 87]
3        12.Air France         10075  Budapest      Paris          [13]
4            Swiss Air         10085  Brussels     London      [67, 32]

In [19]:
df1=pd.DataFrame(df.RecentDelays.values.tolist()).add_prefix("Delays")

In [20]:
df1.head()

   Delays0  Delays1  Delays2
0     23.0     47.0      NaN
1      NaN      NaN      NaN
2     24.0     43.0     87.0
3     13.0      NaN      NaN
4     67.0     32.0      NaN

In [21]:
df3=pd.merge(df, df1, left_index=True, right_index=True)

In [22]:
df3.head()

,Airline,FlightNumber,From,To,RecentDelays,Delays0,Delays1,Delays2
0,KLM(!),10045,London,Paris,"[23, 47]",23.0,47.0,NaN
1,<Air France>(12),10055,Madrid,Milan,[],NaN,NaN,NaN
2,(British Airways. ),10065,London,Stockholm,"[24, 43, 87]",24.0,43.0,87.0
3,12.Air France,10075,Budapest,Paris,[13],13.0,NaN,NaN
4,Swiss Air,10085,Brussels,London,"[67, 32]",67.0,32.0,NaN

In [23]:
df3=df3.drop(columns=['RecentDelays'])
df3.head()

,Airline,FlightNumber,From,To,Delays0,Delays1,Delays2
0,KLM(!),10045,London,Paris,23.0,47.0,NaN
1,<Air France>(12),10055,Madrid,Milan,NaN,NaN,NaN
2,(British Airways. ),10065,London,Stockholm,24.0,43.0,87.0
3,12.Air France,10075,Budapest,Paris,13.0,NaN,NaN
4,Swiss Air,10085,Brussels,London,67.0,32.0,NaN

In [24]:
df3=df3.rename(columns={'Delays0':'Delays_1','Delays1':'Delay_2','Delays2':'Delay_3'})

In [25]:
df3.head()

,Airline,FlightNumber,From,To,Delays_1,Delay_2,Delay_3
0,KLM(!),10045,London,Paris,23.0,47.0,NaN
1,<Air France>(12),10055,Madrid,Milan,NaN,NaN,NaN
2,(British Airways. ),10065,London,Stockholm,24.0,43.0,87.0
3,12.Air France,10075,Budapest,Paris,13.0,NaN,NaN
4,Swiss Air,10085,Brussels,London,67.0,32.0,NaN